Revit 2027 API
IFCFile.Create Method
 Creates an IFC file for exporting.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCFile Create(
	IFCFileModelOptions modelOptions
)
Public Shared Function Create (
	modelOptions As IFCFileModelOptions
) As IFCFile
public:
static IFCFile^ Create(
	IFCFileModelOptions^ modelOptions
)
static member Create :
        modelOptions : IFCFileModelOptions -> IFCFile
Parameters
modelOptions IFCFileModelOptions
 The options.
Return Value
IFCFile
 The IFC file.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCFile Class
Autodesk.Revit.DB.IFC Namespace